'''Задайте список. Напишите программу, которая определит,
присутствует ли в заданном списке строк некое число.'''

import main as Function1
print(Function1.CheckList([1,2,3,4,5,6,7,8],0))
print(Function1.CheckList([1,2,3,4,5,6,7,8],1))
print(Function1.CheckList([1,2,3,4,5,6,7,8],7))
print(Function1.CheckList([1,2,3,4,5,6,7,8],10))