'''Задайте список. Напишите программу, которая определит,
присутствует ли в заданном списке строк некое число.'''

import main as CheckList

print(main.CheckList([1,2,3,4,5,6,7,8],0))